[
    {
      "id": 1,
      "estate_title": "Cozy Single-Family Home",
      "segment_name": "Single Family Home",
      "description": "Tucked away in a tranquil suburban neighborhood in Springfield, Illinois, this cozy single-family home offers a serene retreat for small families or couples seeking comfort and convenience. Boasting a generous 1800 square feet of living space, this residence features a spacious living room perfect for gatherings, a modern kitchen equipped for culinary adventures, and a delightful backyard garden ideal for outdoor relaxation. Whether enjoying quiet evenings indoors or hosting gatherings with loved ones, this charming abode provides the perfect backdrop for creating lasting memories. With its convenient location close to local amenities and recreational facilities, residents can enjoy the best of suburban living while staying connected to the vibrant community around them.",
      "price": "$300,000",
      "status": "sale",
      "area": "1800 sq ft",
      "location": "Suburban Neighborhood, Springfield, Illinois",
      "facilities": ["Living Room", "Kitchen", "Backyard"],
      "image": "https://i.ibb.co/ZdKFRPK/istockphoto-1255835530-1024x1024.jpg"
    },
    {
      "id": 2,
      "estate_title": "Luxurious Townhouse",
      "segment_name": "Townhouse",
      "description": "Nestled in the heart of a bustling metropolitan city in New York, this luxurious townhouse offers an unparalleled urban living experience. Spread across three floors of lavish living space, this residence epitomizes sophistication and modernity. From the private garage for added convenience to the expansive rooftop terrace offering panoramic views of the city skyline, every aspect of this townhouse is designed with luxury in mind. With 2500 square feet of meticulously crafted interiors, including a sleek kitchen and spacious living areas, this residence provides the perfect setting for both relaxation and entertainment. Situated in close proximity to cultural attractions, fine dining establishments, and vibrant nightlife, residents can immerse themselves in the dynamic energy of city living while enjoying the comfort and privacy of their own luxurious retreat.",
      "price": "$500,000",
      "status": "sale",
      "area": "2500 sq ft",
      "location":  "Downtown, Metro City, New York",
      "facilities": ["Living Room", "Kitchen", "Rooftop Terrace", "Garage"],
      "image": "https://i.ibb.co/pbCK1bj/istockphoto-1393537665-1024x1024.jpg"
    },
    {
      "id": 3,
      "estate_title": "Modern Apartment",
      "segment_name": "Apartment",
      "description": "Experience the epitome of urban living in this modern apartment located in the bustling Financial District of Baytown, Texas. Offering stunning views of the cityscape through floor-to-ceiling windows, this stylish residence combines contemporary design with luxurious amenities. With 1000 square feet of thoughtfully curated living space, including a gourmet kitchen and a spacious living area, this apartment provides the perfect balance of comfort and sophistication. Residents can take advantage of exclusive building amenities such as a state-of-the-art fitness center and a rooftop pool, ideal for relaxation and leisure. Conveniently situated near major attractions, dining establishments, and entertainment venues, this apartment offers residents unparalleled access to the vibrant city life. Whether enjoying a quiet evening at home or exploring all that the city has to offer, residents can embrace urban living at its finest in this chic Baytown apartment.",
      "price": "$2,500/month",
      "status": "rent",
      "area": "1000 sq ft",
      "location": "Financial District, Baytown, Texas",
      "facilities": ["Living Room", "Kitchen", "Fitness Center", "Rooftop Pool"],
      "image": "https://i.ibb.co/CWJ4Scv/istockphoto-1177797403-1024x1024.jpg"
    },
    {
      "id": 4,
      "estate_title": "Student Housing Complex",
      "segment_name": "Student Housing",
      "description": "Ideally located on the bustling campus of Ivy College Town in Massachusetts, this modern student housing complex offers a comfortable and convenient living environment for students. Featuring furnished units with shared common areas, study lounges, and on-site laundry facilities, this complex is designed to meet the unique needs of student life. With flexible leasing options and a variety of floor plans to choose from, students can find the perfect accommodation to suit their lifestyle and budget. The proximity to campus ensures easy access to academic buildings, libraries, and campus amenities, allowing students to focus on their studies without the hassle of a lengthy commute. Additionally, the communal spaces provide opportunities for socializing and building connections with fellow students, creating a vibrant and supportive community atmosphere. Whether studying for exams, relaxing with friends, or participating in campus events, residents of this student housing complex can enjoy all that college life has to offer in a comfortable and inclusive environment.",
      "price": "$1000/month",
      "status": "rent",
      "area": "800 sq ft",
      "location": "University Campus, Ivy College Town, Massachusetts",
      "facilities": ["Shared Common Areas", "Study Lounges", "Laundry Facilities"],
      "image": "https://i.ibb.co/p2gVK0H/istockphoto-1410534409-1024x1024.jpg"
    },
    {
      "id": 5,
      "estate_title": "Senior Living Community",
      "segment_name": "Senior Living",
      "description": "Discover a welcoming retreat for seniors in the tranquil surroundings of Tranquil Valley, California, at this vibrant senior living community. Offering a range of lifestyle options, including independent living, assisted living, and memory care services, this community is designed to cater to the unique needs and preferences of each resident. With beautifully landscaped gardens, a state-of-the-art wellness center, and restaurant-style dining, residents can enjoy a fulfilling and enriching retirement experience. Whether participating in group fitness classes, socializing with friends in the communal areas, or simply relaxing in the comfort of their own apartment, residents have ample opportunities to lead an active and fulfilling lifestyle. The dedicated staff members provide personalized care and support, ensuring that each resident feels valued and respected. Located in close proximity to local amenities and attractions, this senior living community offers residents the perfect blend of tranquility and convenience, allowing them to enjoy their golden years to the fullest in a warm and welcoming environment.",
      "price": "$4,000/month",
      "status": "rent",
      "area": "1400 sq ft",
      "location": "Retirement Village, Tranquil Valley, California",
      "facilities": ["Landscaped Gardens", "Wellness Center", "Restaurant Dining"],
      "image": "https://i.ibb.co/Y0cSBgG/istockphoto-1170308490-1024x1024.jpg"
    },
    {
      "id": 6,
      "estate_title": "Seaside Vacation Rental",
      "segment_name": "Vacation Rental",
      "description": "Escape to the picturesque coastal town of Florida for a relaxing beachfront getaway at this stunning seaside vacation rental. Situated just steps away from the ocean, this fully furnished rental offers breathtaking views and luxurious amenities for a memorable vacation experience. The spacious living room and well-appointed kitchen provide the perfect setting for entertaining guests or enjoying quiet evenings with loved ones. Step outside onto the expansive deck to soak in the sunshine, savor al fresco meals, or simply unwind to the sound of the waves crashing against the shore. Whether lounging on the beach, exploring nearby attractions, or indulging in water sports, guests can enjoy a wide range of activities and experiences just moments from their doorstep. With its idyllic location, modern amenities, and unparalleled ocean views, this seaside vacation rental promises an unforgettable retreat for guests seeking relaxation, adventure, and rejuvenation by the sea.",
      "price": "$300/night",
      "status": "rent",
      "area": "1500 sq ft",
      "location": "Oceanfront, Coastal Town, Florida",
      "facilities": ["Living Room", "Kitchen", "Ocean Views", "Deck"],
      "image": "https://i.ibb.co/xf3cJTb/istockphoto-836169234-1024x1024.jpg"
    },
    {
      "id": 7,
      "estate_title": "Historic Villa",
      "segment_name": "Vacation Rental",
      "description": "Experience the charm and elegance of a bygone era at this exquisite historic villa nestled in the scenic countryside of Oregon's picturesque vineyard region. Surrounded by lush gardens and rolling hills, this beautifully restored villa offers a tranquil retreat for guests seeking peace and serenity. Featuring traditional architecture, tastefully appointed interiors, and modern amenities, this villa seamlessly blends old-world charm with contemporary comfort. Guests can relax in the spacious living room, prepare meals in the fully equipped kitchen, or dine al fresco on the private terrace overlooking the landscaped gardens. The inviting outdoor pool provides the perfect spot for a refreshing swim on warm summer days, while the surrounding vineyards offer opportunities for wine tasting and exploration. Whether seeking a romantic getaway, a family retreat, or a gathering with friends, this historic villa provides a memorable setting for special occasions and unforgettable moments in the heart of Oregon's wine country.",
      "price": "$700/night",
      "status": "rent",
      "area": "3000 sq ft",
      "location": "Rural Countryside, Vineyard Region, Oregon",
      "facilities": ["Living Room", "Kitchen", "Private Pool", "Gardens"],
      "image": "https://i.ibb.co/Sxw3gpY/istockphoto-453090855-1024x1024.jpg"
    },
    {
      "id": 8,
      "estate_title": "City Center Condo",
      "segment_name": "Apartment",
      "description": "Immerse yourself in the vibrant energy of Harbor City's downtown core with a stay at this stylish city center condo. Located within walking distance of shops, restaurants, and cultural attractions, this contemporary condo offers convenience and comfort for urban adventurers. The open-concept living space features modern furnishings, sleek finishes, and floor-to-ceiling windows that flood the interior with natural light and offer sweeping views of the city skyline. The well-equipped kitchen is perfect for preparing meals at home, while the cozy living area provides a relaxing space to unwind after a day of exploring the city. Guests can take advantage of the building's amenities, including a fitness center and communal lounge, or venture out to discover the vibrant neighborhood and its many attractions. Whether visiting for business or pleasure, this city center condo provides the perfect home base for experiencing all that Harbor City has to offer, from its bustling streets and cultural landmarks to its diverse culinary scene and vibrant nightlife.",
      "price": "$400,000",
      "status": "sale",
      "area": "1200 sq ft",
      "location": "Downtown Core, Harbor City, Washington",
      "facilities": ["Living Room", "Kitchen", "Close to Amenities"],
      "image": "https://i.ibb.co/HzmTcvm/istockphoto-488120139-1024x1024.jpg"
    },
    {
      "id": 9,
      "estate_title": "Golf Course Home",
      "segment_name": "Single Family Home",
      "description": "Enjoy the ultimate golfing lifestyle at this luxurious home nestled within the prestigious Fairway Estates community in Arizona. Overlooking the manicured greens of the local golf course, this spacious residence offers breathtaking views and unparalleled access to world-class amenities. With 2800 square feet of living space, including a spacious living room, gourmet kitchen, and elegant master suite, this home is designed for comfort and luxury. Step outside onto the expansive patio to soak in the stunning views, entertain guests, or simply relax in the Arizona sunshine. Residents of Fairway Estates can take advantage of exclusive privileges, including access to the clubhouse, fitness center, and swimming pool, as well as special events and social activities. Whether honing your golf skills on the course, exploring the scenic beauty of the surrounding desert landscape, or simply enjoying the tranquility of life in this exclusive community, residents of this golf course home can experience the best that Arizona has to offer in a setting of unparalleled luxury and refinement.",
      "price": "$600,000",
      "status": "sale",
      "area": "2800 sq ft",
      "location": "Golf Course Community, Fairway Estates, Arizona",
      "facilities": ["Living Room", "Kitchen", "Golf Course Views"],
      "image": "https://i.ibb.co/zmqWBkN/istockphoto-477756421-1024x1024.jpg"
    }
  ]
  